Enums/упПараметрыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упПараметрыРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяНачалаПогрузкиПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяНачалаПогрузкиФактическое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяНачалаРазгрузкиПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяНачалаРазгрузкиФактическое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОкончанияПогрузкиПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОкончанияПогрузкиФактическое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОкончанияРазгрузкиПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОкончанияРазгрузкиФактическое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОтправленияПоПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОтправленияСПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяПолученияПоПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяПолученияСПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяПростояПоВинеЗаказчикаЧасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяПростояПоВинеПеревозчикаЧасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоОтопитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяРаботыЧас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрузоподъемностьТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗонаОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗонаПолучения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРасходаТопливаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЗагрузочныхМетровГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЗагрузочныхМетровТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоМестГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоМестТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТочекВМаршруте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТочекПогрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТочекРазгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МассаГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаОтопитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемныйВес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценочнаяСтоимостьГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановаяСуммаИнкассации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановыеРасходыПоПеревозке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредполагаемаяСтоимостьПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расстояние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемператураВоздуха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемпературныйРежим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическиеРасходыПоЗаявке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЗаданийСРаботамиПоПеревозкеГрузаВМаршруте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоНормаРасходаТопливаНа100км</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоНормаРасходаТопливаНа1часРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаГорнаяМестность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаГрузовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаДлительнаяЭксплуатация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаЗимний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаКлиматКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаКондиционер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаНаселенныйПункт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаПростой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаСложностьДорог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаСпециальноеОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоГорнаяМестность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоГрузовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоДлительнаяЭксплуатация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТопливаЗимний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоКлиматКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоКондиционер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоНаселенныйПункт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПростой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоСложностьДорог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоСпециальноеОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоПлановыйРасчетТоплива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоНормативныйРасчетТоплива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоРасчетТопливаПоДопОборудованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Моточасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоточасыСГрузом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПробегСГрузом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МассаПрицепногоСостава</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упПараметрыРасчета/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
		
	СписокИсключений = Новый СписокЗначений;
	СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ПлановыеРасходыПоПеревозке);
	СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ПредполагаемаяСтоимостьПеревозки);
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоЗагрузочныхМетров") Тогда 
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоЗагрузочныхМетровГруза);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоЗагрузочныхМетровТС);
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоМест") Тогда 
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоМестГруза);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоМестТС);
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьМассу") Тогда 
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.МассаГруза);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ГрузоподъемностьТС);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ОбъемныйВес);
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками") Тогда 
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоЗагрузочныхМетровГруза);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоМестГруза);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ОценочнаяСтоимостьГруза);
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упКонтролироватьТемпературныеРежимы") Тогда 
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ТемпературныйРежим);
	КонецЕсли;	

			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упПараметрыРасчета.Ссылка
	|ИЗ
	|	Перечисление.упПараметрыРасчета КАК упПараметрыРасчета
	|ГДЕ
	|	НЕ упПараметрыРасчета.Ссылка В (&СписокИсключений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	упПараметрыРасчета.Порядок";
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти
